Revit 2027 API
BuiltInFailures.ViewFailures.ZeroLengthViewBreaksRemoved Property
 Some View Regions were consolidated. When the size of a View Break between View Regions becomes zero, the View Break is removed and the adjacent View Regions are joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ZeroLengthViewBreaksRemoved { get; }
Public Shared ReadOnly Property ZeroLengthViewBreaksRemoved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ZeroLengthViewBreaksRemoved {
	FailureDefinitionId^ get ();
}
static member ZeroLengthViewBreaksRemoved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace